app/views/questions/show.html.erb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
           	<% if current_user.email!=@question.user.email %>
			<% if HasVotoQuestion.where(question_id: @question.id).where(user_id: current_user.id).any? %>

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
---
<div class="field">
<% if @question.answers.any? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
					<% if user_signed_in? %>
						<% if answercomment.user.email==current_user.email || current_user.puntaje>=Permiso.first.admin %>