app/controllers/answers_controller.rb

INSERT INTO "answers" ("user_id", "question_id", "texto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["question_id", 1], ["texto", "what?"], ["created_at", "2017-11-17 00:23:38.848014"], ["updated_at", "2017-11-17 00:23:38.848014"]]
---
  def create
    @answer = current_user.answers.new(answer_params)
    @answer.question = @question
    @question.update(cant_answers: @question.cant_answers + 1)
    @answer.puntaje = 0
    @answer.best = false;

    respond_to do |format|
      if @answer.save

UPDATE "answers" SET "texto" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["texto", "what? editando"], ["updated_at", "2017-11-20 21:16:10.470900"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @answer.update(answer_params)