app/controllers/questions_controller.rb

  def create
    @question = current_user.questions.new(question_params)
    @question.puntaje= 0
    @question.tags = params[:tags]
    respond_to do |format|
      if params[:tags]!=nil
        if params[:tags].length <6
          if @question.save
---
INSERT INTO "questions" ("titulo", "texto", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["titulo", "Billie Jean"], ["texto", "Not my lover she is just a girl "], ["created_at", "2017-11-16 06:24:15.528446"], ["updated_at", "2017-11-16 06:24:15.528446"], ["user_id", 1]]

  def update
    @question.tags=nil
    @question.tags = params[:tags]
    respond_to do |format|
        if params[:tags]!=nil
        if params[:tags].length <6
          if @question.update(question_params)
---
UPDATE "questions" SET "texto" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["texto", "COmo se usa?? estoy editando la pregunta"], ["updated_at", "2017-11-17 04:15:11.467638"], ["id", 3]]